backend: tensorflow
class_name: Functional
config:
  input_layers:
  - - input_1
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 16384
      - 4
      dtype: float32
      name: input_1
      ragged: false
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Functional
    config:
      input_layers:
      - - input_2
        - 0
        - 0
      layers:
      - class_name: InputLayer
        config:
          batch_input_shape: !!python/tuple
          - null
          - 16384
          - 4
          dtype: float32
          name: input_2
          ragged: false
          sparse: false
        inbound_nodes: []
        name: input_2
      - class_name: Conv1D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer:
            class_name: L2
            config:
              l2: 9.999999747378752e-06
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          dtype: float32
          filters: 64
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer:
            class_name: MotifRegularizer
            config:
              filter_width: 8
              motif_definitions: null
              n_filters: 64
              strength: 1.0e-05
          kernel_size: !!python/tuple
          - 8
          name: conv1d
          padding: same
          strides: !!python/tuple
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - input_2
            - 0
            - 0
            - {}
        name: conv1d
      - class_name: ReLU
        config:
          dtype: float32
          max_value: null
          name: re_lu
          negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - &id001 !!python/name:numpy.ndarray ''
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - &id002 !!python/object/apply:numpy.dtype
              args:
              - f4
              - 0
              - 1
              state: !!python/tuple
              - 3
              - <
              - null
              - null
              - null
              - -1
              - -1
              - 0
            - false
            - !!binary |
              AAAAAA==
          threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          trainable: true
        inbound_nodes:
        - - - conv1d
            - 0
            - 0
            - {}
        name: re_lu
      - class_name: Conv1D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer:
            class_name: L2
            config:
              l2: 9.999999747378752e-06
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          dtype: float32
          filters: 32
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer:
            class_name: L2
            config:
              l2: 9.999999747378752e-06
          kernel_size: !!python/tuple
          - 1
          name: conv1d_1
          padding: same
          strides: !!python/tuple
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - re_lu
            - 0
            - 0
            - {}
        name: conv1d_1
      - class_name: ReLU
        config:
          dtype: float32
          max_value: null
          name: re_lu_1
          negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          trainable: true
        inbound_nodes:
        - - - conv1d_1
            - 0
            - 0
            - {}
        name: re_lu_1
      name: MotifModel-1xConv1d-0xResid
      output_layers:
      - - re_lu_1
        - 0
        - 0
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: MotifModel-1xConv1d-0xResid
  - class_name: Cropping1D
    config:
      cropping: !!python/tuple
      - 0
      - 0
      dtype: float32
      name: cropping1d
      trainable: true
    inbound_nodes:
    - - - MotifModel-1xConv1d-0xResid
        - 1
        - 0
        - {}
    name: cropping1d
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 2
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization
      scale: true
      trainable: true
    inbound_nodes:
    - - - cropping1d
        - 0
        - 0
        - {}
    name: batch_normalization
  - class_name: ReLU
    config:
      dtype: float32
      max_value: null
      name: re_lu_2
      negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      trainable: true
    inbound_nodes:
    - - - batch_normalization
        - 0
        - 0
        - {}
    name: re_lu_2
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      kernel_size: !!python/tuple
      - 11
      name: conv1d_2
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - re_lu_2
        - 0
        - 0
        - {}
    name: conv1d_2
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 2
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_2
        - 0
        - 0
        - {}
    name: batch_normalization_1
  - class_name: ReLU
    config:
      dtype: float32
      max_value: null
      name: re_lu_3
      negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      trainable: true
    inbound_nodes:
    - - - batch_normalization_1
        - 0
        - 0
        - {}
    name: re_lu_3
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      kernel_size: !!python/tuple
      - 11
      name: conv1d_3
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - re_lu_3
        - 0
        - 0
        - {}
    name: conv1d_3
  - class_name: Add
    config:
      dtype: float32
      name: add
      trainable: true
    inbound_nodes:
    - - - cropping1d
        - 0
        - 0
        - &id003 {}
      - - conv1d_3
        - 0
        - 0
        - *id003
    name: add
  - class_name: MaxPooling1D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling1d
      padding: valid
      pool_size: &id004 !!python/tuple
      - 2
      strides: *id004
      trainable: true
    inbound_nodes:
    - - - add
        - 0
        - 0
        - {}
    name: max_pooling1d
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 2
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - max_pooling1d
        - 0
        - 0
        - {}
    name: batch_normalization_2
  - class_name: ReLU
    config:
      dtype: float32
      max_value: null
      name: re_lu_4
      negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      trainable: true
    inbound_nodes:
    - - - batch_normalization_2
        - 0
        - 0
        - {}
    name: re_lu_4
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      kernel_size: !!python/tuple
      - 11
      name: conv1d_4
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - re_lu_4
        - 0
        - 0
        - {}
    name: conv1d_4
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 2
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_3
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_4
        - 0
        - 0
        - {}
    name: batch_normalization_3
  - class_name: ReLU
    config:
      dtype: float32
      max_value: null
      name: re_lu_5
      negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      trainable: true
    inbound_nodes:
    - - - batch_normalization_3
        - 0
        - 0
        - {}
    name: re_lu_5
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      kernel_size: !!python/tuple
      - 11
      name: conv1d_5
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - re_lu_5
        - 0
        - 0
        - {}
    name: conv1d_5
  - class_name: Add
    config:
      dtype: float32
      name: add_1
      trainable: true
    inbound_nodes:
    - - - max_pooling1d
        - 0
        - 0
        - &id005 {}
      - - conv1d_5
        - 0
        - 0
        - *id005
    name: add_1
  - class_name: MaxPooling1D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling1d_1
      padding: valid
      pool_size: *id004
      strides: *id004
      trainable: true
    inbound_nodes:
    - - - add_1
        - 0
        - 0
        - {}
    name: max_pooling1d_1
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 2
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_4
      scale: true
      trainable: true
    inbound_nodes:
    - - - max_pooling1d_1
        - 0
        - 0
        - {}
    name: batch_normalization_4
  - class_name: ReLU
    config:
      dtype: float32
      max_value: null
      name: re_lu_6
      negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      trainable: true
    inbound_nodes:
    - - - batch_normalization_4
        - 0
        - 0
        - {}
    name: re_lu_6
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      kernel_size: !!python/tuple
      - 11
      name: conv1d_6
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - re_lu_6
        - 0
        - 0
        - {}
    name: conv1d_6
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 2
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_5
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_6
        - 0
        - 0
        - {}
    name: batch_normalization_5
  - class_name: ReLU
    config:
      dtype: float32
      max_value: null
      name: re_lu_7
      negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      trainable: true
    inbound_nodes:
    - - - batch_normalization_5
        - 0
        - 0
        - {}
    name: re_lu_7
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      kernel_size: !!python/tuple
      - 11
      name: conv1d_7
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - re_lu_7
        - 0
        - 0
        - {}
    name: conv1d_7
  - class_name: Add
    config:
      dtype: float32
      name: add_2
      trainable: true
    inbound_nodes:
    - - - max_pooling1d_1
        - 0
        - 0
        - &id006 {}
      - - conv1d_7
        - 0
        - 0
        - *id006
    name: add_2
  - class_name: MaxPooling1D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling1d_2
      padding: valid
      pool_size: *id004
      strides: *id004
      trainable: true
    inbound_nodes:
    - - - add_2
        - 0
        - 0
        - {}
    name: max_pooling1d_2
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 2
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_6
      scale: true
      trainable: true
    inbound_nodes:
    - - - max_pooling1d_2
        - 0
        - 0
        - {}
    name: batch_normalization_6
  - class_name: ReLU
    config:
      dtype: float32
      max_value: null
      name: re_lu_8
      negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      trainable: true
    inbound_nodes:
    - - - batch_normalization_6
        - 0
        - 0
        - {}
    name: re_lu_8
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      kernel_size: !!python/tuple
      - 11
      name: conv1d_8
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - re_lu_8
        - 0
        - 0
        - {}
    name: conv1d_8
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 2
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_7
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_8
        - 0
        - 0
        - {}
    name: batch_normalization_7
  - class_name: ReLU
    config:
      dtype: float32
      max_value: null
      name: re_lu_9
      negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      trainable: true
    inbound_nodes:
    - - - batch_normalization_7
        - 0
        - 0
        - {}
    name: re_lu_9
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      kernel_size: !!python/tuple
      - 11
      name: conv1d_9
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - re_lu_9
        - 0
        - 0
        - {}
    name: conv1d_9
  - class_name: Add
    config:
      dtype: float32
      name: add_3
      trainable: true
    inbound_nodes:
    - - - max_pooling1d_2
        - 0
        - 0
        - &id007 {}
      - - conv1d_9
        - 0
        - 0
        - *id007
    name: add_3
  - class_name: MaxPooling1D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling1d_3
      padding: valid
      pool_size: *id004
      strides: *id004
      trainable: true
    inbound_nodes:
    - - - add_3
        - 0
        - 0
        - {}
    name: max_pooling1d_3
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 2
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_8
      scale: true
      trainable: true
    inbound_nodes:
    - - - max_pooling1d_3
        - 0
        - 0
        - {}
    name: batch_normalization_8
  - class_name: ReLU
    config:
      dtype: float32
      max_value: null
      name: re_lu_10
      negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      trainable: true
    inbound_nodes:
    - - - batch_normalization_8
        - 0
        - 0
        - {}
    name: re_lu_10
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 2
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      kernel_size: !!python/tuple
      - 11
      name: conv1d_10
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - re_lu_10
        - 0
        - 0
        - {}
    name: conv1d_10
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 2
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_9
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_10
        - 0
        - 0
        - {}
    name: batch_normalization_9
  - class_name: ReLU
    config:
      dtype: float32
      max_value: null
      name: re_lu_11
      negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      trainable: true
    inbound_nodes:
    - - - batch_normalization_9
        - 0
        - 0
        - {}
    name: re_lu_11
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 2
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      kernel_size: !!python/tuple
      - 11
      name: conv1d_11
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - re_lu_11
        - 0
        - 0
        - {}
    name: conv1d_11
  - class_name: Add
    config:
      dtype: float32
      name: add_4
      trainable: true
    inbound_nodes:
    - - - max_pooling1d_3
        - 0
        - 0
        - &id008 {}
      - - conv1d_11
        - 0
        - 0
        - *id008
    name: add_4
  - class_name: MaxPooling1D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling1d_4
      padding: valid
      pool_size: *id004
      strides: *id004
      trainable: true
    inbound_nodes:
    - - - add_4
        - 0
        - 0
        - {}
    name: max_pooling1d_4
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 2
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_10
      scale: true
      trainable: true
    inbound_nodes:
    - - - max_pooling1d_4
        - 0
        - 0
        - {}
    name: batch_normalization_10
  - class_name: ReLU
    config:
      dtype: float32
      max_value: null
      name: re_lu_12
      negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      trainable: true
    inbound_nodes:
    - - - batch_normalization_10
        - 0
        - 0
        - {}
    name: re_lu_12
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 2
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      kernel_size: !!python/tuple
      - 11
      name: conv1d_12
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - re_lu_12
        - 0
        - 0
        - {}
    name: conv1d_12
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 2
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_11
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_12
        - 0
        - 0
        - {}
    name: batch_normalization_11
  - class_name: ReLU
    config:
      dtype: float32
      max_value: null
      name: re_lu_13
      negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      trainable: true
    inbound_nodes:
    - - - batch_normalization_11
        - 0
        - 0
        - {}
    name: re_lu_13
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 2
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      kernel_size: !!python/tuple
      - 11
      name: conv1d_13
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - re_lu_13
        - 0
        - 0
        - {}
    name: conv1d_13
  - class_name: Add
    config:
      dtype: float32
      name: add_5
      trainable: true
    inbound_nodes:
    - - - max_pooling1d_4
        - 0
        - 0
        - &id009 {}
      - - conv1d_13
        - 0
        - 0
        - *id009
    name: add_5
  - class_name: MaxPooling1D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling1d_5
      padding: valid
      pool_size: *id004
      strides: *id004
      trainable: true
    inbound_nodes:
    - - - add_5
        - 0
        - 0
        - {}
    name: max_pooling1d_5
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 2
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_12
      scale: true
      trainable: true
    inbound_nodes:
    - - - max_pooling1d_5
        - 0
        - 0
        - {}
    name: batch_normalization_12
  - class_name: ReLU
    config:
      dtype: float32
      max_value: null
      name: re_lu_14
      negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      trainable: true
    inbound_nodes:
    - - - batch_normalization_12
        - 0
        - 0
        - {}
    name: re_lu_14
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 2
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      kernel_size: !!python/tuple
      - 11
      name: conv1d_14
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - re_lu_14
        - 0
        - 0
        - {}
    name: conv1d_14
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 2
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_13
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_14
        - 0
        - 0
        - {}
    name: batch_normalization_13
  - class_name: ReLU
    config:
      dtype: float32
      max_value: null
      name: re_lu_15
      negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      trainable: true
    inbound_nodes:
    - - - batch_normalization_13
        - 0
        - 0
        - {}
    name: re_lu_15
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 2
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      kernel_size: !!python/tuple
      - 11
      name: conv1d_15
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - re_lu_15
        - 0
        - 0
        - {}
    name: conv1d_15
  - class_name: Add
    config:
      dtype: float32
      name: add_6
      trainable: true
    inbound_nodes:
    - - - max_pooling1d_5
        - 0
        - 0
        - &id010 {}
      - - conv1d_15
        - 0
        - 0
        - *id010
    name: add_6
  - class_name: MaxPooling1D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling1d_6
      padding: valid
      pool_size: *id004
      strides: *id004
      trainable: true
    inbound_nodes:
    - - - add_6
        - 0
        - 0
        - {}
    name: max_pooling1d_6
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 2
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_14
      scale: true
      trainable: true
    inbound_nodes:
    - - - max_pooling1d_6
        - 0
        - 0
        - {}
    name: batch_normalization_14
  - class_name: ReLU
    config:
      dtype: float32
      max_value: null
      name: re_lu_16
      negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple
          - 0
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          AAAAAA==
      trainable: true
    inbound_nodes:
    - - - batch_normalization_14
        - 0
        - 0
        - {}
    name: re_lu_16
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 2
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer:
        class_name: L2
        config:
          l2: 9.999999747378752e-06
      kernel_size: !!python/tuple
      - 11
      name: conv1d_16
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - re_lu_16
        - 0
        - 0
        - {}
    name: conv1d_16
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 2
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_15
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1d_16
        - 0
        - 0
        - {}
